app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."ip" = $1  [["ip", "127.0.0.1"]]
---
  def index
    @photos = Photo.where(ip: request.remote_ip).all

INSERT INTO "photos" ("avatar", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["avatar", "Screenshot_from_2018-09-12_20-13-11.png"], ["created_at", "2018-09-13 16:21:14.670000"], ["updated_at", "2018-09-13 16:21:14.670000"]]
---
  def create
    @photo = Photo.new(photo_params)
	params[:pictures].each do |s, i|
		#@photo[ip] = params[:ip]
		#@photo[avatar] = s
		@photo= Photo.new(ip: params[:photo][:ip],avatar: s)
		@photo.save